WIP use mermaid? Seems fragile
Graphs aren't pre-rendered, so they aren't checked by the build
process. This means a low effort drive-by contribution could kill
a diagram, so diagrams have to be checked even for trivial changes,
and updates are scary.
https://github.com/badboy/mdbook-mermaid/issues/36
